### Terraform Plan - `dev` Environment

<details>
<summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01NjQwMDBmNi05NDQ3LTQ2OTktYjg3ZS1iZWIzZDA1MjliYzQ7b2JqZWN0SWQ9MTg3ZjEwMTgtZWVhNi00YWU4LWJiMWItOGNjN2ZlYzFkNWM5O3N1YnNjcmlwdGlvbklkPWRjMjJkNmQ4LTA0OTUtNDY1My1hNjliLWVkZmUxNjg0MGY4ZTt0ZW5hbnRJZD02MWE4NzQ2ZS00MjRkLTQxMDUtYTA1NC1iMzg1NzNkNmU1NGE=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service_virtual_network_swift_connection.chatops will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "chatops" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_application_gateway.chatops will be created
  + resource "azurerm_application_gateway" "chatops" {
      + firewall_policy_id          = (known after apply)
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "chatops-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rg-chatops-dev"
      + tags                        = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "Purpose"     = "Application Gateway with WAF"
        }

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "backend-pool"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "backend-http-settings"
          + pick_host_name_from_backend_address = true
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "health-probe"
          + protocol                            = "Https"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "frontend-ip-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "https-port"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway-ip-config"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "frontend-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https-port"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "https-listener"
          + protocol                       = "Https"
          + require_sni                    = false
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "appgw-ssl-cert"
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "health-probe"
          + path                                      = "/health"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "backend-pool"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "backend-http-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "https-listener"
          + id                         = (known after apply)
          + name                       = "routing-rule"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # azurerm_application_insights.chatops will be created
  + resource "azurerm_application_insights" "chatops" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "chatops-appinsights"
      + resource_group_name                   = "rg-chatops-dev"
      + retention_in_days                     = 90
      + sampling_percentage                   = 90
      + tags                                  = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + workspace_id                          = (known after apply)
    }

  # azurerm_application_insights_standard_web_test.chatops_australiaeast will be created
  + resource "azurerm_application_insights_standard_web_test" "chatops_australiaeast" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "apac-au-syd-edge",
        ]
      + id                      = (known after apply)
      + location                = "australiaeast"
      + name                    = "chatops-availability-australiaeast"
      + resource_group_name     = "rg-chatops-dev"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "TestRegion"  = "australiaeast"
        }
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://chatops-app-dev.azurewebsites.net/health"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true

          + content {
              + content_match      = "healthy"
              + ignore_case        = false
              + pass_if_text_found = true
            }
        }
    }

  # azurerm_application_insights_standard_web_test.chatops_eastus will be created
  + resource "azurerm_application_insights_standard_web_test" "chatops_eastus" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "us-va-ash-azr",
        ]
      + id                      = (known after apply)
      + location                = "eastus"
      + name                    = "chatops-availability-eastus"
      + resource_group_name     = "rg-chatops-dev"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "TestRegion"  = "eastus"
        }
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://chatops-app-dev.azurewebsites.net/health"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true

          + content {
              + content_match      = "healthy"
              + ignore_case        = false
              + pass_if_text_found = true
            }
        }
    }

  # azurerm_application_insights_standard_web_test.chatops_northeurope will be created
  + resource "azurerm_application_insights_standard_web_test" "chatops_northeurope" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "northeurope"
      + name                    = "chatops-availability-northeurope"
      + resource_group_name     = "rg-chatops-dev"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "TestRegion"  = "northeurope"
        }
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://chatops-app-dev.azurewebsites.net/health"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true

          + content {
              + content_match      = "healthy"
              + ignore_case        = false
              + pass_if_text_found = true
            }
        }
    }

  # azurerm_application_insights_standard_web_test.chatops_southeastasia will be created
  + resource "azurerm_application_insights_standard_web_test" "chatops_southeastasia" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "apac-sg-sin-azr",
        ]
      + id                      = (known after apply)
      + location                = "southeastasia"
      + name                    = "chatops-availability-southeastasia"
      + resource_group_name     = "rg-chatops-dev"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "TestRegion"  = "southeastasia"
        }
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://chatops-app-dev.azurewebsites.net/health"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true

          + content {
              + content_match      = "healthy"
              + ignore_case        = false
              + pass_if_text_found = true
            }
        }
    }

  # azurerm_application_insights_standard_web_test.chatops_westus will be created
  + resource "azurerm_application_insights_standard_web_test" "chatops_westus" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "us-ca-sjc-azr",
        ]
      + id                      = (known after apply)
      + location                = "westus"
      + name                    = "chatops-availability-westus"
      + resource_group_name     = "rg-chatops-dev"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "TestRegion"  = "westus"
        }
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://chatops-app-dev.azurewebsites.net/health"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true

          + content {
              + content_match      = "healthy"
              + ignore_case        = false
              + pass_if_text_found = true
            }
        }
    }

  # azurerm_key_vault.chatops will be created
  + resource "azurerm_key_vault" "chatops" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-chatops-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + tenant_id                     = "61a8746e-424d-4105-a054-b38573d6e54a"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_certificate.appgw_ssl will be created
  + resource "azurerm_key_vault_certificate" "appgw_ssl" {
      + certificate_attribute           = (known after apply)
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "appgw-ssl-cert"
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + tags                            = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "Self-Signed SSL Certificate for Testing"
          + "Warning"     = "Replace with proper certificate before production"
        }
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)

      + certificate_policy {
          + issuer_parameters {
              + name = "Self"
            }
          + key_properties {
              + curve      = (known after apply)
              + exportable = true
              + key_size   = 2048
              + key_type   = "RSA"
              + reuse_key  = true
            }
          + lifetime_action {
              + action {
                  + action_type = "AutoRenew"
                }
              + trigger {
                  + days_before_expiry = 30
                }
            }
          + secret_properties {
              + content_type = "application/x-pkcs12"
            }
          + x509_certificate_properties {
              + extended_key_usage = [
                  + "1.3.6.1.5.5.7.3.1",
                ]
              + key_usage          = [
                  + "cRLSign",
                  + "dataEncipherment",
                  + "digitalSignature",
                  + "keyAgreement",
                  + "keyCertSign",
                  + "keyEncipherment",
                ]
              + subject            = "CN=chatops.example.com"
              + validity_in_months = 12

              + subject_alternative_names {
                  + dns_names = [
                      + "*.chatops.example.com",
                      + "chatops.example.com",
                    ]
                }
            }
        }
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be created
  + resource "azurerm_key_vault_secret" "appinsights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "appinsights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "ConnectionString"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.bot_app_id will be created
  + resource "azurerm_key_vault_secret" "bot_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "bot-app-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "AppIdentifier"
          + "Service"     = "TeamsBot"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.bot_app_password will be created
  + resource "azurerm_key_vault_secret" "bot_app_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "bot-app-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "ClientSecret"
          + "Service"     = "TeamsBot"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.entra_client_secret will be created
  + resource "azurerm_key_vault_secret" "entra_client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "entra-client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "ClientSecret"
          + "Service"     = "EntraID"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.github_app_id will be created
  + resource "azurerm_key_vault_secret" "github_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "github-app-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "AppIdentifier"
          + "Service"     = "GitHub"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.github_app_private_key will be created
  + resource "azurerm_key_vault_secret" "github_app_private_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "github-app-private-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "PrivateKey"
          + "Service"     = "GitHub"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.github_webhook_secret will be created
  + resource "azurerm_key_vault_secret" "github_webhook_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "github-webhook-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "WebhookSecret"
          + "Service"     = "GitHub"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.chatops will be created
  + resource "azurerm_linux_web_app" "chatops" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "chatops-app-service"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-chatops-dev"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }

          + ip_restriction {
              + action     = "Allow"
              + ip_address = "10.0.2.0/24"
              + name       = "AllowApplicationGateway"
              + priority   = 100
            }
          + ip_restriction {
              + action     = "Deny"
              + ip_address = "0.0.0.0/0"
              + name       = "DenyAll"
              + priority   = 2147483647
            }
        }
    }

  # azurerm_log_analytics_workspace.chatops will be created
  + resource "azurerm_log_analytics_workspace" "chatops" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "chatops-loganalytics"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-chatops-dev"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_action_group.ops_alerts will be created
  + resource "azurerm_monitor_action_group" "ops_alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "ops-alerts"
      + resource_group_name = "rg-chatops-dev"
      + short_name          = "OpsAlert"
      + tags                = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }

      + email_receiver {
          + email_address = "ops-team@company.com"
          + name          = "Operations Team"
        }
    }

  # azurerm_monitor_action_group.security_alerts will be created
  + resource "azurerm_monitor_action_group" "security_alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "security-alerts"
      + resource_group_name = "rg-chatops-dev"
      + short_name          = "SecAlerts"
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }

      + email_receiver {
          + email_address           = "security-team@company.com"
          + name                    = "security-team"
          + use_common_alert_schema = true
        }
    }

  # azurerm_monitor_autoscale_setting.chatops_app_plan will be created
  + resource "azurerm_monitor_autoscale_setting" "chatops_app_plan" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "chatops-app-plan-autoscale"
      + resource_group_name = "rg-chatops-dev"
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + target_resource_id  = (known after apply)

      + notification {
          + email {
              + custom_emails                         = [
                  + "ops-team@company.com",
                ]
              + send_to_subscription_administrator    = false
              + send_to_subscription_co_administrator = false
            }
        }

      + profile {
          + name = "default"

          + capacity {
              + default = 1
              + maximum = 5
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + metric_name        = "CpuPercentage"
                  + metric_resource_id = (known after apply)
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 75
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "CpuPercentage"
                  + metric_resource_id = (known after apply)
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 25
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_resource_id = (known after apply)
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 85
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_resource_id = (known after apply)
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 30
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "app-service-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AppServiceAppLogs"
        }
      + enabled_log {
          + category = "AppServiceAuditLogs"
        }
      + enabled_log {
          + category = "AppServiceConsoleLogs"
        }
      + enabled_log {
          + category = "AppServiceHTTPLogs"
        }
      + enabled_log {
          + category = "AppServiceIPSecAuditLogs"
        }
      + enabled_log {
          + category = "AppServicePlatformLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_diagnostic_setting.appgw_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "appgw_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "appgw-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ApplicationGatewayAccessLog"
        }
      + enabled_log {
          + category = "ApplicationGatewayFirewallLog"
        }
      + enabled_log {
          + category = "ApplicationGatewayPerformanceLog"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_diagnostic_setting.kv_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "kv-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.availability_test_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "availability_test_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when availability tests fail from multiple regions within 10 minutes, indicating potential service outage or degradation."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "availability-test-failure"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 1
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT10M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                availabilityResults
                | where timestamp > ago(10m)
                | where success == false
                | summarize FailedRegions = dcount(location)
            EOT
          + threshold               = 2
          + time_aggregation_method = "Maximum"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.failed_dependency will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "failed_dependency" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when more than 5 dependency calls fail within 15 minutes, indicating downstream service issues."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "failed-dependency"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                dependencies
                | where timestamp > ago(15m)
                | where success == false
                | summarize Count = count()
            EOT
          + threshold               = 5
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "high_exception_rate" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when the exception rate exceeds 10 exceptions in 5 minutes, indicating potential application issues requiring investigation."
      + enabled                                = true
      + evaluation_frequency                   = "PT1M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "high-exception-rate"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                exceptions
                | where timestamp > ago(5m)
                | summarize Count = count()
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.kv_failed_auth will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "kv_failed_auth" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when Key Vault authentication failures exceed threshold, indicating potential brute-force or credential stuffing attacks."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "kv-failed-authentication-alert"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where ResourceType == "VAULTS"
                | where ResultSignature == "Unauthorized" or ResultSignature == "Forbidden" or httpStatusCode_d >= 400
                | summarize FailedAttempts = count() by bin(TimeGenerated, 15m)
            EOT
          + threshold               = 5
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_access_anomaly will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "kv_secret_access_anomaly" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when secret access from a single IP exceeds threshold, indicating potential data exfiltration or compromised credentials."
      + enabled                                = true
      + evaluation_frequency                   = "PT1H"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "kv-secret-access-anomaly-alert"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 1
      + tags                                   = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + window_duration                        = "PT1H"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where ResourceType == "VAULTS"
                | where OperationName in ("SecretGet", "SecretList")
                | summarize AccessCount = count() by CallerIPAddress, bin(TimeGenerated, 1h)
            EOT
          + threshold               = 100
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_expiration will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "kv_secret_expiration" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when Key Vault audit logs indicate items are near expiry or have expired, triggering investigation for rotation."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "kv-secret-expiration-alert"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 3
      + tags                                   = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where ResourceType == "VAULTS"
                | where OperationName has_any ("NearExpiry", "Expired")
                | summarize ExpiringItems = count() by Resource, OperationName, bin(TimeGenerated, 1d)
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "slow_response_time" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when average request duration exceeds 5 seconds, indicating performance degradation."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "slow-response-time"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 3
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                requests
                | where timestamp > ago(5m)
                | summarize AvgDuration = avg(duration)
            EOT
          + threshold               = 5000
          + time_aggregation_method = "Average"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_network_security_group.app_nsg will be created
  + resource "azurerm_network_security_group" "app_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "app-nsg"
      + resource_group_name = "rg-chatops-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_network_security_group.gateway_nsg will be created
  + resource "azurerm_network_security_group" "gateway_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "gateway-nsg"
      + resource_group_name = "rg-chatops-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_network_security_rule.allow_gateway_inbound will be created
  + resource "azurerm_network_security_rule" "allow_gateway_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowGatewayInbound"
      + network_security_group_name = "app-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "10.0.2.0/24"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow_gateway_manager will be created
  + resource "azurerm_network_security_rule" "allow_gateway_manager" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "65200-65535"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowGatewayManager"
      + network_security_group_name = "gateway-nsg"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "GatewayManager"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow_https_inbound will be created
  + resource "azurerm_network_security_rule" "allow_https_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPSInbound"
      + network_security_group_name = "gateway-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "Internet"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow_internet_outbound will be created
  + resource "azurerm_network_security_rule" "allow_internet_outbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowInternetOutbound"
      + network_security_group_name = "app-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.deny_all_inbound will be created
  + resource "azurerm_network_security_rule" "deny_all_inbound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "app-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_watcher.chatops will be created
  + resource "azurerm_network_watcher" "chatops" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "chatops-network-watcher"
      + resource_group_name = "rg-chatops-dev"
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_network_watcher_flow_log.app_nsg_flow_log will be created
  + resource "azurerm_network_watcher_flow_log" "app_nsg_flow_log" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "app-nsg-flow-log"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "chatops-network-watcher"
      + resource_group_name       = "rg-chatops-dev"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 90
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "eastus"
          + workspace_resource_id = (known after apply)
        }
    }

  # azurerm_public_ip.appgw will be created
  + resource "azurerm_public_ip" "appgw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "chatops-appgw-pip"
      + resource_group_name     = "rg-chatops-dev"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "Purpose"     = "Application Gateway Public IP"
        }
    }

  # azurerm_resource_group.chatops will be created
  + resource "azurerm_resource_group" "chatops" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-chatops-dev"
      + tags     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
    }

  # azurerm_role_assignment.appgw_kv_secrets_user will be created
  + resource "azurerm_role_assignment" "appgw_kv_secrets_user" {
      + description                      = "Application Gateway managed identity access for reading SSL certificates"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kv_secrets_user_app_service will be created
  + resource "azurerm_role_assignment" "kv_secrets_user_app_service" {
      + description                      = "App Service managed identity access for reading secrets"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.chatops will be created
  + resource "azurerm_service_plan" "chatops" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "chatops-app-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-chatops-dev"
      + sku_name                     = "P1v3"
      + tags                         = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.nsg_flow_logs will be created
  + resource "azurerm_storage_account" "nsg_flow_logs" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + 

... (output truncated)
```

</details>

*Pusher: @deividfoggi, Action: `pull_request`, Workflow: `Infrastructure - PR Validation`*